trade_exp/src/Documents/ИзучениеАссортимента/ИзучениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3966a33-4e26-4291-8885-291481276d8a">
  <name>ИзучениеАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="faae7a24-5d27-40be-a7b6-1e05f58e63fa">
    <name>ТочкаПересчетаОбучение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="035828aa-7633-4717-b475-b1b0ec830fcf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="96cc621f-b44f-4924-8c9f-5377f80fc628">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab2c60eb-13c2-4bfc-af5c-dc6dde24f839">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef1aadab-b747-444b-bb54-218663ee9a3c">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10d9aa4c-055c-4234-839d-84735907ce3d">
    <name>ПоследняяОткрытаяСтрока</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3b90ff3f-1959-4a33-8f18-be5e98056bbd">
    <name>ВремяВСекундах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c56ed891-7433-499a-91b0-1fc6e34d488a">
    <name>Ассортимент</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="25a5259f-a415-48b7-a747-57e549e4ca1e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1e118687-55e4-4900-abc6-ec4188238f3f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56befc85-bfa6-47b0-8b4d-221f84b59c34">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e83b1228-7d2d-41ff-9a3a-e84cba1ed1bd">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3a639c1-2b27-41d6-9e27-94d99668f40f">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыИзученияАссортимента/СтатусыИзученияАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b8741559-a5a0-44ab-931a-df1aeff1e73d">
  <name>СтатусыИзученияАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8564513f-0f2d-491a-ac7c-64ef64c0afd1">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33c771d2-6d52-456c-bbad-dc89bc47e50b">
    <name>Приостановлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d645579e-93ba-4c44-9d28-1579b408b6a0">
    <name>Завершено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0fea131b-da9a-4b00-8d36-556cdedec563">
    <name>НеИзучено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/РабочиеУчастки/РабочиеУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c863b06-6e02-4c69-add5-1e7cdc4b412d">
  <name>РабочиеУчастки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Порядок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОграничиватьПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПорядокОбработкиСкладскогоЗадания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПреднаборке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВыдачаВОкно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПриемкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользуетсяВОтгрузкеСТСД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаСкладскихЯчеекХраненияПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d60f4b7b-33b6-404d-a00a-86bdd9eddd85">
    <name>ИнтервалОповещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0d146d97-4688-44d2-86c1-47fc265eda01">
    <name>СкрытьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24236bcd-ee24-4288-b790-a71e6ec62dae">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45e29f47-2a23-4196-a70d-24909d3aaaae">
    <name>ЭлектроннаяОчередь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ИзучениеАссортимента/Forms/ФормаДокументаТСД/Module.bsl
#Область ПеременныеФормы
&НаКлиенте
Перем БылаОшибкаНаКарточке; // Для выдачи второй попытки сканирования товара
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сотрудник = Параметры.Сотрудник;
		Объект.Сотрудник = Сотрудник;
		Объект.Склад = Сотрудник.Склад;
		Повтор = ?(Параметры.Свойство("Повтор"), Истина, Ложь);
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.ВРаботе");
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Точка = Объект.ТочкаПересчетаОбучение;
			
		ИначеЕсли Параметры.Свойство("ТочкаПересчетаОбучение") И ЗначениеЗаполнено(Параметры.ТочкаПересчетаОбучение) Тогда
			Точка = Параметры.ТочкаПересчетаОбучение;
			
		Иначе
		    Точка = Неопределено;
		КонецЕсли; 
		
		Объект.ТочкаПересчетаОбучение = ПолучитьТочкуДляИзучения(Сотрудник, Повтор, Точка);
		ТекущаяСтрока = 0;
		
	Иначе
		ТекущаяСтрока = Объект.ПоследняяОткрытаяСтрока;
	КонецЕсли;
	
	ВремяНачала = ТекущаяДата();
	ЭтаФорма.Заголовок = Объект.ТочкаПересчетаОбучение.Наименование;   
	
	//Подключение оповещений из очереди 
	
	Сотрудник = Объект.Сотрудник;

	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = Сотрудник.ОповещенияИзОчереди; 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;     
	ИнтервалОповещений = Инт;

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
	ИнициализироватьСканер();
	
	ЗаполнитьРеквизитыПоТекущейСтроке(ТекущаяСтрока); 
	
	Если ОповещенияИзОчереди Тогда
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;
	ИнициализироватьСканер();
	
КонецПроцедуры
#КонецОбласти


#Область КомандыФормы
&НаКлиенте
Процедура Далее(Команда)
	
	Если Комментарий = "" Тогда
		Сообщить("Заполните комментарий");
	Иначе
		Проверено = Истина;
		ПереходКСледующейКарточке();
		Проверено = Ложь;
	КонецЕсли;  
	
КонецПроцедуры
                                
&НаКлиенте
Процедура Пауза(Команда) 
	
	Объект.ПоследняяОткрытаяСтрока = ТекущаяСтрока;
	ОтключитьСканер();
	ЗаписатьВремя();
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);        
	ПровестиДокумент();
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбучение(Команда) 
	
	УстановитьСтатус();
	ОтключитьСканер();
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаСервере
Процедура ПровестиДокумент()
	УстановитьПривилегированныйРежим(Истина);
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КСледующейГруппе(Команда) 
	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Сотрудник", Объект.Сотрудник);
	ЭтаФорма.Закрыть();
	ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы);  
	
КонецПроцедуры

&НаКлиенте
Процедура Повторить(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Повтор", Истина);
	ПараметрыФормы.Вставить("Сотрудник", Объект.Сотрудник);
	ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка); 
	ЭтаФорма.Закрыть();
	ОткрытьФорму("Документ.ИзучениеАссортимента.Форма.ФормаДокументаТСД", ПараметрыФормы);  
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ЗаписатьВремя()
	Объект.ВремяВСекундах = Объект.ВремяВСекундах + Число((ТекущаяДата() - ВремяНачала));
КонецПроцедуры

Функция ПолучитьТочкуДляИзучения(Сотрудник, ПовторноеИзучение, Точка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзучениеАссортимента.ТочкаПересчетаОбучение КАК ТочкаПересчетаОбучение
		|ПОМЕСТИТЬ ВТ_Изучено
		|ИЗ
		|	Документ.ИзучениеАссортимента КАК ИзучениеАссортимента
		|ГДЕ
		|	ИзучениеАссортимента.Сотрудник = &Сотрудник
		|	И НЕ ИзучениеАссортимента.ПометкаУдаления
		|	И ИзучениеАссортимента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИзученияАссортимента.Завершено)
		|{ГДЕ
		|	(ИзучениеАссортимента.ТочкаПересчетаОбучение = &Точка) КАК Повтор}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ВидыНоменклатуры.Ссылка КАК Вид,
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение КАК Точка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
		|ПОМЕСТИТЬ ВТ_Виды
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыНаСкладахОстатки.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ПО РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В(&РабочийУчасток)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение КАК Точка
		|ПОМЕСТИТЬ ВТ_Точка
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение.ЭтоТочка
		|	И (НЕ ВидыНоменклатуры.ТочкаПересчетаОбучение В
		|					(ВЫБРАТЬ
		|						ВТ_Изучено.ТочкаПересчетаОбучение
		|					ИЗ
		|						ВТ_Изучено КАК ВТ_Изучено)
		|			ИЛИ &ПовторноеИзучение)
		|	И (НЕ &ПовторноеИзучение
		|			ИЛИ ВидыНоменклатуры.ТочкаПересчетаОбучение В (&Точка))
		|	И ВидыНоменклатуры.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Виды.Вид
		|			ИЗ
		|				ВТ_Виды КАК ВТ_Виды)
		|	И ВидыНоменклатуры.ТочкаПересчетаОбучение.Порядок <> 168
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыНоменклатуры.ТочкаПересчетаОбучение.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Виды.Номенклатура КАК Номенклатура,
		|	ВТ_Виды.Характеристика КАК Характеристика,
		|	ВТ_Виды.Ячейка КАК Ячейка,
		|	ВТ_Виды.Точка КАК Точка,
		|	ВТ_Виды.Секция КАК Секция
		|ИЗ
		|	ВТ_Виды КАК ВТ_Виды
		|ГДЕ
		|	ВТ_Виды.Точка В
		|			(ВЫБРАТЬ
		|				ВТ_Точка.Точка
		|			ИЗ
		|				ВТ_Точка)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("РабочийУчасток", Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"));
	Запрос.УстановитьПараметр("ПовторноеИзучение", ПовторноеИзучение);
	Запрос.УстановитьПараметр("Точка", ?(ПовторноеИзучение, Точка, Неопределено));
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаТочка = МассивРезультатов[2].Выгрузить()[0][0];
	
	СформироватьТабЧасть(МассивРезультатов[3].Выгрузить());
	
	Возврат ВыборкаТочка;

КонецФункции

Процедура СформироватьТабЧасть(ТЗ)
	
	ТаблицаТоваров = ПолучитьТоварыПоСекции(ТЗ);
	КоличествоТоваров = ТаблицаТоваров.Количество();
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСтрок = Новый Массив;
	КоличествоСтрок = ?(КоличествоТоваров < 20, КоличествоТоваров, 20); //изменить
	Пока МассивСтрок.Количество() < КоличествоСтрок Цикл
		НомерСтроки = ГСЧ.СлучайноеЧисло(0, КоличествоТоваров-1);
		Если МассивСтрок.Найти(ТаблицаТоваров[НомерСтроки]) = Неопределено Тогда
			МассивСтрок.Добавить(ТаблицаТоваров[НомерСтроки]);
		КонецЕсли;
	КонецЦикла;
	ВременнаяТЗ = ТаблицаТоваров.Скопировать(МассивСтрок);
	ВременнаяТЗ.Сортировать("Ячейка Возр, Номенклатура Возр");
	Объект.Ассортимент.Загрузить(ВременнаяТЗ);   
	
КонецПроцедуры

Функция ПолучитьТоварыПоСекции(ТЗ)
	
	Секции = ТЗ.Скопировать();
	Секции.Свернуть("Секция");
	КоличествоСекций = Секции.Количество();
	Если КоличествоСекций > 1 Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		НомерСтроки = ГСЧ.СлучайноеЧисло(0, КоличествоСекций-1);
	Иначе
		НомерСтроки = 0;
	КонецЕсли;
	Секция = Секции[НомерСтроки].Секция;
	Объект.Секция = Секция;
	Отбор = Новый Структура;
    Отбор.Вставить("Секция", Секция);
	КопияТЗ = ТЗ.Скопировать(Отбор);
	Возврат КопияТЗ;   
	
КонецФункции

Процедура ПолучитьАдресКартинки(Номенклатура)
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ФайлКартинки");
	Если ЗначениеЗаполнено(ФайлКартинки) Тогда
		Попытка
			АдресКартинки = РаботаСФайлами.ДанныеФайла(ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
		    АдресКартинки = "";
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗавершениеОбучения();
	
	Элементы.ГруппаИзученияКарточки.Видимость = Ложь;
	Элементы.ГруппаКомандЗавершение.Видимость = Истина;
	
	УстановитьСтатус();
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.Завершено") Тогда
		Элементы.Декорация1.Заголовок = "Поздравляем, группа изучена.";
		Элементы.Повторить.Видимость = Ложь;
	Иначе
		Элементы.Декорация1.Заголовок = "Группа не изучена.";
	КонецЕсли;
	ЗаписатьВремя();
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма); 
	ПровестиДокумент();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСтатус();
	
	ПараметрыОтбора = Новый Структура("Проверено", Ложь);
	ЕстьОшибки = Объект.Ассортимент.НайтиСтроки(ПараметрыОтбора);
	
	Если ЕстьОшибки.Количество() = 0 Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.Завершено");
	Иначе
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИзученияАссортимента.НеИзучено");
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПереходКСледующейКарточке()
	
	ЗаполнитьПройденнуюСтрокуТЧ(ТекущаяСтрока);
	ТекущаяСтрока = ТекущаяСтрока + 1;
	Объект.ПоследняяОткрытаяСтрока = ТекущаяСтрока;

	Если ТекущаяСтрока < Объект.Ассортимент.Количество() Тогда
		ЗаполнитьРеквизитыПоТекущейСтроке(ТекущаяСтрока);
		ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	Иначе
		ПоказатьЗавершениеОбучения();
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПройденнуюСтрокуТЧ(НомерСтроки) 
	
	СтрокаТЧ = Объект.Ассортимент[НомерСтроки];
	СтрокаТЧ.Комментарий = Комментарий;
	СтрокаТЧ.Проверено = Проверено;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоТекущейСтроке(НомерСтроки)
	
	СтрокаТЧ 		= Объект.Ассортимент[НомерСтроки];
	Номенклатура	= СтрокаТЧ.Номенклатура;
	Ячейка 			= СтрокаТЧ.Ячейка;
	Характеристика 	= СтрокаТЧ.Характеристика;
	Проверено 		= СтрокаТЧ.Проверено;
	Комментарий 	= СтрокаТЧ.Комментарий;
	ПолучитьАдресКартинки(Номенклатура); 
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСоСканером

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Сообщить("Точка1");
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		//Сообщить("Точка2");
		Если (ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode") Тогда 
			//Сообщить("Точка3");
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 = Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			//Сообщить("Точка4");
			Данные = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			Штрихкод = Данные.Штрихкод;
			//Сообщить(Данные.Штрихкод);
			Если ПустаяСтрока(Штрихкод) Тогда
				ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!", 5);
				//Сообщить("Точка5");
				Возврат;
			КонецЕсли;
			//Сообщить("Точка6");
			ОбработатьШтрихкод(Штрихкод);
			//Сообщить("Точка7");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер() 
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
	#КонецЕсли  
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьШтрихкод(Команда)
	
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			ПоказатьПредупреждение(, "Сканирование не поддерживается!", 5);
		КонецЕсли;
	#КонецЕсли  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат И ЗначениеЗаполнено(Штрихкод) Тогда
		
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Если Не ПустаяСтрока(Штрихкод) Тогда
			ОбработатьШтрихкод(Штрихкод);
		Иначе
			ПоказатьПредупреждение(, "Не удалось прочитать штрихкод! Считайте штрихкод еще раз", 5);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)
	
	РезультатСканирования = ПолучитьДанныеПоШтрикоду(Штрихкод, Номенклатура, Характеристика, Ячейка);
	Если Не РезультатСканирования Тогда
		Сигнал();
		#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
				СредстваМультимедиа.ВоспроизвестиТекст("Отсканирован неверно!", "ru-RU");
			КонецЕсли;
		#КонецЕсли
		
		Если БылаОшибкаНаКарточке = Неопределено ИЛИ БылаОшибкаНаКарточке = Ложь Тогда
			БылаОшибкаНаКарточке = Истина;
			ПоказатьПредупреждение(, "Вы неверно нашли товар! Внимательно сверьте наименование товара и отсканируйте нужный",,"Товар отсканирован неверно");
			Ошибка = "Первая попытка: Отсканирован неверно";
			Комментарий = ?(Комментарий = "", Ошибка, Комментарий + Символы.ПС + Ошибка);
		Иначе
			БылаОшибкаНаКарточке = Ложь;
			ПоказатьПредупреждение(, "Разберите ошибку с наставником по окончанию сборки",,"Товар отсканирован неверно");
			Ошибка = "Вторая попытка: Отсканирован неверно";
			Комментарий = ?(Комментарий = "", Ошибка, Комментарий + Символы.ПС + Ошибка);
		КонецЕсли;
	Иначе
		БылаОшибкаНаКарточке = Ложь;
		Проверено = Истина;
	КонецЕсли;
	
	Если БылаОшибкаНаКарточке = Неопределено ИЛИ БылаОшибкаНаКарточке = Ложь Тогда
		ПереходКСледующейКарточке();
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрикоду(Штрихкод, Номенклатура, Характеристика, Ячейка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК Ответ
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
	               |		ПО Штрихкоды.Номенклатура = Ячейки.Номенклатура
	               |ГДЕ
	               |	Штрихкоды.Штрихкод = &Штрихкод
	               |	И Штрихкоды.Номенклатура = &Номенклатура
	               |	И Штрихкоды.Характеристика = &Характеристика
	               |	И Ячейки.Ячейка = &Ячейка";	
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти      


#Область Оповещения 
Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции


&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды, ОткрытьОчередь",Сотрудник,"Отгрузка", Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти
